/*すぐわかるC/C++、塚越一雄著、1.7~1.8節*/
/*場合分け、くりかえし(ループ)*/

//等値演算子:x==y, x!=yなど
//関係演算子:x<y, X<=yなど
//論理演算子:x==y&&a==b, x!=y||a!=bなど
//非ゼロ判定: if(--x), if(y)など
//逆転条件式:if(!--x), if(!y)など

#include <stdio.h>//入出力などが行える基本ライブラリ
#include <stdlib.h>//文字列からint型への変換に必要

main()
{
    char s[80];
    int old;

    printf("あなたの現在の年齢は?\n=>");
    gets(s);
    old = atoi(s);//文字列からint型への変換

//ifを使った場合分け＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
    if(old>=20)
        printf("飲酒可能\n");
    else if(old>17&&old<20)
        printf("将来飲酒できるようになるかもしれない");
    else
        printf("飲酒不可\n");
    
//switchを使った場合分け＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
    switch(old){//old_intに代入した理由はswitch(整数型)でないといけないから(多分)
    case 17://;(セミコロン)ではないので注意
        printf("将来あと1年で飲酒できるかもしれない\n");
        break;
    case 19:
        printf("あと1年で飲酒できる\n");
    default://無くても良い
        printf("子供\n");
    }

//whileを使ったくりかえし＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
    int answer = 22;

    while (old !=answer){
        printf("あなたの現在の年齢は?\n=>");
        gets(s);
        old=atoi(s);

        int p = 4;
        while (old!=22 && p-- > 0){//--p > 0の場合は「正直に言え」表示が3回になる
            printf("正直に言え\n");
        }
    }
    printf("そうですね\n");

//do~whileを使ったくりかえし＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
    do{//条件判別する前に必ず1回は実行する
        printf("嘘ついていませんね？本当のあなたの年齢は?\n=>");
        gets(s);
        old= atoi(s);
    }while(old<20);//20より下の年齢なら繰り返す
    printf("警察は必要ありませんね\n");

//forを使ったくりかえし＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
    for (int i=0; i<3; i++)
  /*for (  式1  ; 条件; 式2)＊iはループカウンタと言う。
        以下、文。          ＊1.式1を実行、2.条件判定、3.結果が真なら文と式2を実行。*/
        if(old>=20)
            printf("あなたの年齢が%dということは%d年前に成人したということですね\n",old,old-20);
        else
            printf("あなたの年齢が%dということは%d年後に成人するということですね\n",old,20-old);


    return 0;

}